GabrielPCamargo/nke_esp32c3/src/NKE.c
/*
 * 
 * Versao com implementação de fila de print - 
 *    06/06/2025 
 *
*/

#include <mdk.h>
#include <esp32c3_regs.h>

/*
*
* Vari veis do Kernel
*
*/
/*Define intervalo das interrup  es de Clock 
 * Tabela de Interrup  es :
 * 1       ClkT = 1   segundo
 * 0.1     ClkT = 100 milissegundos
 * 0.01    Clkt = 10  milissegundos
 * 0.001   Clkt = 1   milissegundo
 * 0.0001  ClkT = 100 microssegundos
 * 0.00001 ClkT = 10  microssegundos
*/
#define ClkT 2 //equivale a 2 segundos

// SYSTIMER clock = 16 MHz → 1000 ms = 16_000_000 ticks
// PERIOD field is 26 bits max (67 million), so 16_000_000 fits fine (1s)
#define Slice 16000000UL //1 segundo
#define MaxNumberTask 4
#define NUM_TASKS 4
#define SizeTaskStack 2048// Tamanho da pilha da tarefa
#define MAX_NKREAD_QUEUE 5 // N mero m ximo de threads esperando por leitura
#define MAX_NKPRINT_QUEUE 50 // Número máximo de mensagens esperando por impressão
#define MAX_NAME_LENGTH 30
unsigned int NumberTaskAdd=-1;
volatile int TaskRunning = 0;
volatile bool os_started = false;
char myName[MAX_NAME_LENGTH];
int  SchedulerAlgorithm ;


enum Scheduler{
  RR,
  RM,
  EDF
};
enum Taskstates{
  INITIAL,
  READY,
  RUNNING,
  DEAD,
  BLOCKED
};
typedef struct 
{
    int queue[MaxNumberTask];
    int tail;
    int head;
}ReadyList;
ReadyList ready_queue;

typedef struct 
{
  short count;
  int sem_queue[MaxNumberTask], tail, header;
}sem_t;

typedef struct {
    int tid; // ID da thread esperando pela leitura
    const char *format; // Formato da entrada esperado (similar ao scanf)
    void *var; // Argumentos onde os dados ser o armazenados
} NkReadQueueEntry;

typedef struct {
    const char *format; // Formato da entrada esperado (similar ao printf)
    char type; // 'd', 'f', 'c', 's', '%'
    union {
        int i;
        float f;
        char c;
        const char *s;
    } var; // Variável que será impressa
} NkPrintQueueEntry;

NkReadQueueEntry nkreadQueue[MAX_NKREAD_QUEUE];
int nkreadQueueHead = 0;
int nkreadQueueTail = 0;

NkPrintQueueEntry nkprintQueue[MAX_NKPRINT_QUEUE];
int nkprintQueueHead = 0;
int nkprintQueueTail = 0;
volatile bool printTailMutex;
volatile bool printHeadMutex;

char serialInputBuffer[128]; // Buffer para armazenar a entrada da serial
int serialInputIndex = 0;

typedef struct
{
  int CallNumber;
  unsigned char *p0;
  unsigned char *p1;
  unsigned char *p2;
  unsigned char *p3;
}Parameters;
volatile Parameters kernelargs ;


typedef struct {
  int16_t Tid;
  const char *name;
  unsigned short Prio;
  uint8_t Period;
  uint8_t Wcet;
  uint8_t DynamicPeriod;
  uint8_t DynamicWcet;
  unsigned int Time;
  unsigned short Join;
  unsigned short State;
  uint8_t Stack[SizeTaskStack]; // Vetor de pilha
  uint8_t* P; // Ponteiro de pilha
} TaskDescriptor;
TaskDescriptor Descriptors[MaxNumberTask]; // Array de descritores de tarefas


// Aparentemente estava quebrando sem os paddings (mas revisar)
typedef struct {
    uint32_t ra, t0, t1, t2;
    uint32_t s0, s1;
    uint32_t a0, a1, a2, a3, a4, a5, a6, a7;
    uint32_t s2, s3, s4, s5, s6, s7, s8, s9, s10, s11;
    uint32_t t3, t4, t5, t6;
    uint32_t mstatus, mepc;
    uint32_t padding1, padding2;
} Context;
/*
*Servicos do kernel
*
*/
enum sys_temCall{
  TASKCREATE,
  SEM_WAIT,
  SEM_POST,
  SEM_INIT,
  WRITELCDN,
  WRITELCDS,
  EXITTASK,
  SLEEP,
  MSLEEP,
  USLEEP,
  RMSSLEEP,
  LIGALED,
  DESLIGALED,
  START, 
  TASKJOIN,
  SETMYNAME,
  GETMYNAME,
  NKPRINT,
  GETMYNUMBER,
  NKREAD,
};

/*************************************************************
*                                                            *
* Rotinas do kernel                                          *
*                                                            *
*                                                            *
*************************************************************/

__attribute__((naked)) void trap_return_ecall(void)
{
    __asm__ volatile (
        "csrr t0, mepc \n\t"
        "addi t0, t0, 4 \n\t"
        "csrw mepc, t0 \n\t"
        "mret\n\t"
    );
}


void kernel(Parameters *args) {
    kernelargs = *args;

    switch(kernelargs.CallNumber){
    case TASKCREATE: 
      sys_taskcreate((int *)kernelargs.p0,(void(*)())kernelargs.p1,(uint8_t)kernelargs.p2, (uint8_t)kernelargs.p3);
      break;
    case SEM_WAIT: 
     // Serial.println("SEMWAIT: ") ;
      sys_semwait((sem_t *)kernelargs.p0);
      break;
    case SEM_POST: 
      sys_sempost((sem_t *)kernelargs.p0);
      break;
    case SEM_INIT: 
      //Serial.println("SEMINIT: ") ;
      sys_seminit((sem_t *)kernelargs.p0,(int)kernelargs.p1);
      break;
    case WRITELCDN: // NAO TEREMOS
      // LCDcomando((int)arg->p1);
      // LCDnum((int)arg->p0);
      break;
    case WRITELCDS: // NAO TEREMOS
      // LCDcomando((int)arg->p1);
      // LCDputs((char*)arg->p0);
      break;
    case EXITTASK: 
      sys_taskexit();
      break;
    case SLEEP: 
      sys_sleep((int)kernelargs.p0);
      break;
    case MSLEEP: 
      sys_msleep((int)kernelargs.p0);
      break;
    case USLEEP: 
      sys_usleep((int)kernelargs.p0);
      break;
    case RMSSLEEP: 
      sys_rmssleep();
      break;
    case LIGALED: 
      sys_ligaled();
      break;
    case DESLIGALED: 
      sys_desligaled();
      break;
    case START: 
      sys_start((int)kernelargs.p0);
      break;
    case TASKJOIN: // NAO TEREMOS
     // sys_taskjoin((int)arg->p0);
      break;
    case SETMYNAME: 
      sys_setmyname((const char *)kernelargs.p0);
      break;
    case GETMYNAME: 
      sys_getmyname((const char *)kernelargs.p0);
      break;  
    case NKPRINT: 
       sys_nkprint((char *)kernelargs.p0,(void *)kernelargs.p1);
       break;
    case GETMYNUMBER: 
       sys_getmynumber((int *)kernelargs.p0);
       break;
    case NKREAD: 
       sys_nkread((char *)kernelargs.p0,(void *)kernelargs.p1);
       break;
    default:
       break;
  }

  //trap_return_ecall();
}
/*
* Passa a executar a rotina do kernel com interrupcoes desabiitadas
*
*/
// void callsvc(Parameters *args)
// {
//   noInterrupts();
//   kernelargs = *args ;
//   kernel() ;
//   interrupts();
// }

// Chamada de sistema já desabilita interrupções, o parâmetro pointeiro args é colocado em a0 (registrador padrão pela ABI)

// void callsvc(Parameters *args)
// {
//     register Parameters *a0 asm("a0") = args;

//     asm volatile("csrci mstatus, 0x8");
//     kernel(a0);
//     asm volatile("csrsi mstatus, 0x8");
// }

