GabrielPCamargo/nke_esp32c3/src/NKE.c
void callsvc(Parameters *args)
{
    // 1. Forçamos o compilador a colocar o ponteiro 'args' no registrador a0.
    // O registrador a0 é o padrão (ABI) para passar o primeiro argumento.
    register Parameters *a0 asm("a0") = args;

    // 2. Disparamos a exceção de hardware "Environment Call" (ecall).
    // O hardware automaticamente pula para o 'ecall_vector' e salva o mepc atual!
    __asm__ volatile("ecall" : : "r"(a0) : "memory");
}

/*
*
*
*/
// --- MACROS DE CONTEXTO ---
#define SAVE_CONTEXT \
    "addi sp, sp, -128 \n\t" \
    "sw ra, 0(sp) \n\t" \
    "sw t0, 4(sp) \n\t" \
    "sw t1, 8(sp) \n\t" \
    "sw t2, 12(sp) \n\t" \
    "sw s0, 16(sp) \n\t" \
    "sw s1, 20(sp) \n\t" \
    "sw a0, 24(sp) \n\t" \
    "sw a1, 28(sp) \n\t" \
    "sw a2, 32(sp) \n\t" \
    "sw a3, 36(sp) \n\t" \
    "sw a4, 40(sp) \n\t" \
    "sw a5, 44(sp) \n\t" \
    "sw a6, 48(sp) \n\t" \
    "sw a7, 52(sp) \n\t" \
    "sw s2, 56(sp) \n\t" \
    "sw s3, 60(sp) \n\t" \
    "sw s4, 64(sp) \n\t" \
    "sw s5, 68(sp) \n\t" \
    "sw s6, 72(sp) \n\t" \
    "sw s7, 76(sp) \n\t" \
    "sw s8, 80(sp) \n\t" \
    "sw s9, 84(sp) \n\t" \
    "sw s10, 88(sp) \n\t" \
    "sw s11, 92(sp) \n\t" \
    "sw t3, 96(sp) \n\t" \
    "sw t4, 100(sp) \n\t" \
    "sw t5, 104(sp) \n\t" \
    "sw t6, 108(sp) \n\t" \
    "csrr t0, mstatus \n\t" \
    "sw t0, 112(sp) \n\t" \
    "csrr t0, mepc \n\t" \
    "sw t0, 116(sp) \n\t"

#define RESTORE_CONTEXT \
    "lw t0, 116(sp) \n\t" \
    "csrw mepc, t0 \n\t" \
    "lw t0, 112(sp) \n\t" \
    "csrw mstatus, t0 \n\t" \
    "lw ra, 0(sp) \n\t" \
    "lw t0, 4(sp) \n\t" \
    "lw t1, 8(sp) \n\t" \
    "lw t2, 12(sp) \n\t" \
    "lw s0, 16(sp) \n\t" \
    "lw s1, 20(sp) \n\t" \
    "lw a0, 24(sp) \n\t" \
    "lw a1, 28(sp) \n\t" \
    "lw a2, 32(sp) \n\t" \
    "lw a3, 36(sp) \n\t" \
    "lw a4, 40(sp) \n\t" \
    "lw a5, 44(sp) \n\t" \
    "lw a6, 48(sp) \n\t" \
    "lw a7, 52(sp) \n\t" \
    "lw s2, 56(sp) \n\t" \
    "lw s3, 60(sp) \n\t" \
    "lw s4, 64(sp) \n\t" \
    "lw s5, 68(sp) \n\t" \
    "lw s6, 72(sp) \n\t" \
    "lw s7, 76(sp) \n\t" \
    "lw s8, 80(sp) \n\t" \
    "lw s9, 84(sp) \n\t" \
    "lw s10, 88(sp) \n\t" \
    "lw s11, 92(sp) \n\t" \
    "lw t3, 96(sp) \n\t" \
    "lw t4, 100(sp) \n\t" \
    "lw t5, 104(sp) \n\t" \
    "lw t6, 108(sp) \n\t" \
    "addi sp, sp, 128 \n\t" \
    "mret \n\t"

// --- HANDLERS C SEGUROS ---
// Estas funções recebem o SP da tarefa interrompida e retornam o SP da nova tarefa a rodar
uint32_t handle_timer(uint32_t current_sp) {
    if (!os_started) return current_sp; // Proteção extra para o timer
    Descriptors[TaskRunning].P = (uint8_t *)current_sp;
    
    SYSTIMER_INT_CLR = (1U << 0);
    (void)SYSTIMER_INT_ST;
    
    wakeUP();
    switchTaskUnsafe(); 
    processPrintQueue();
    
    return (uint32_t)Descriptors[TaskRunning].P;
}

//Funcionou, mas não sei exatamente por qe precisa desse mcause_val (pois não teve fatal error)
uint32_t handle_ecall(uint32_t current_sp) {
    uint32_t mcause_val;
    // Lê o registrador que nos diz O QUE causou a interrupção
    __asm__ volatile("csrr %0, mcause" : "=r"(mcause_val));

    // mcause 8 = Syscall de Usuário | mcause 11 = Syscall de Máquina
    if (mcause_val == 8 || mcause_val == 11) {
        Context *ctx = (Context *)current_sp;
        ctx->mepc += 4; // Apenas se for ecall, nós pulamos a instrução

        Parameters *args = (Parameters *)ctx->a0;

        if (!os_started) {
            kernel(args);
            return current_sp;
        }

        Descriptors[TaskRunning].P = (uint8_t *)current_sp;
        kernel(args); 
        return (uint32_t)Descriptors[TaskRunning].P;
    } 
    else {
        // --- TELA AZUL DA MORTE DO SEU KERNEL ---
        // Caiu aqui? É um erro de memória ou ponteiro inválido!
        Context *ctx = (Context *)current_sp;
        printf("\n\n=== HARD FAULT DETECTADO ===%d\n", TaskRunning);
        printf("Codigo mcause : %u\n", mcause_val);
        printf("mepc (Erro em): 0x%08x\n", ctx->mepc);
        printf("TaskRunning   : %d\n", TaskRunning);
        printf("============================%d\n", TaskRunning);
        
        // Desabilita interrupções e congela o chip para podermos ler o log
        __asm__ volatile("csrci mstatus, 0x8"); 
        while(1); 
    }
}

// --- VETORES NAKED DE INTERRUPÇÃO ---
__attribute__((naked, section(".iram1")))
void timer_vector(void) {
    __asm__ volatile (
        SAVE_CONTEXT
        "mv a0, sp \n\t"          // Passa o SP atual como argumento
        "call handle_timer \n\t"  // Chama a lógica C
        "mv sp, a0 \n\t"          // Assume o SP retornado (pode ser de outra tarefa)
        RESTORE_CONTEXT
    );
}

__attribute__((naked, section(".iram1")))
void ecall_vector(void) {
    __asm__ volatile (
        SAVE_CONTEXT
        "mv a0, sp \n\t"          
        "call handle_ecall \n\t"  
        "mv sp, a0 \n\t"          
        RESTORE_CONTEXT
    );
}

void wakeUP() //acorda a task bloqueada a espera de passagem de tempo
{
  int i=1;
  for(i=1;i<NUM_TASKS; i++)
  {
    //sleep
    if(Descriptors[i].Time>0)
    {
      Descriptors[i].Time--;
      if(Descriptors[i].Time <= 0 && Descriptors[i].State == BLOCKED && Descriptors[i].State != READY)
      {
        Descriptors[i].State = READY;
        InsertReadyList(i) ; //tempo de espera se esgotou
      }
    }

    if(Descriptors[i].DynamicPeriod>0)
    {
      Descriptors[i].DynamicPeriod--;
      if(Descriptors[i].DynamicPeriod <= 0) {
        Descriptors[i].DynamicPeriod = Descriptors[i].Period;
        Descriptors[i].DynamicWcet = Descriptors[i].Wcet;
        if(i != TaskRunning && Descriptors[i].State != READY) { // ← só insere se não estiver rodando
            Descriptors[i].State = READY;
            InsertReadyList(i);
        }
      }
    }
  }

  if(Descriptors[TaskRunning].DynamicWcet>0)
  {
    Descriptors[TaskRunning].DynamicWcet--;
    if(Descriptors[TaskRunning].DynamicWcet <= 0)
    {
      Descriptors[TaskRunning].State = BLOCKED;
    }
  }
}

//Escalonador

