GabrielPCamargo/nke_esp32c3/src/NKE.c
/*
* Imprime a Ready List
* Usada para  testes
*/
void printReadyList() {
    nkprint("Ready list tasks: ", 0);
    for (int i = 0; i < ready_queue.head; i++) {
        nkprint(" Index:", 0);
        nkprint("%d", (void *)&ready_queue.queue[i]);
    }
    nkprint("\n", 0);
}


/*
* Insere a task no final da Ready List
*  sortReadyList() realizada na switchTask()
*/
void InsertReadyList(int id) {
    // verifica se já está na lista
    for (int i = 0; i < ready_queue.head; i++) {
        if (ready_queue.queue[i] == id) return;
    }
    ready_queue.queue[ready_queue.head] = id;
    ready_queue.head++;
}


/*
*   
* Se a task atual n o   Idle (TaskRunning != 0), a task   removida da Ready List
* Caso n o esteja bloqueada, ela   reinserida no final da Ready List
* A remo  o   feita com o deslocamento para a esquerda 
* Chama a fun  o sortReadyList()
* Atualiza TaskRunning com a primeira task da Ready List (TaskRunning = ready_queue.queue[0])
* Se a Ready List estiver vazia, TaskRunning ser  0 (Idle) 
*
*/

void switchTask() {
    //saveContext(&Descriptors[TaskRunning]);
    switchTaskUnsafe();
    //restoreContext(&Descriptors[TaskRunning]);
}

void switchTaskUnsafe() {    

  if (TaskRunning != 0){
    for (int i = 0; i < ready_queue.head - 1; i++) {
      ready_queue.queue[i] = ready_queue.queue[i + 1];
    }
    ready_queue.head--;
    if (Descriptors[TaskRunning].State != BLOCKED)  {   

      // >>> ADICIONE ESTA LINHA ABAIXO <<<
      Descriptors[TaskRunning].State = READY;
      InsertReadyList(TaskRunning);   
    }
  }
  sortReadyList();
  if (ready_queue.head > 0){
    TaskRunning = ready_queue.queue[0];
  } else {
    TaskRunning = 0;
  }
  
  Descriptors[TaskRunning].State = RUNNING;
}

/*
*   
* Algoritmo Bubble Sort para a reordena o da Ready List
* O crit rio de ordena  o   a prioridade (Prio) definida para a task
* Menor valor n merico indica maior prioridade
*
*/
void sortReadyList() {
  for (int i = 0; i < ready_queue.head - 1; i++) {
      for (int j = 0; j < ready_queue.head - i - 1; j++) {
          if (Descriptors[ready_queue.queue[j]].Period > Descriptors[ready_queue.queue[j + 1]].Period) {
              int temp = ready_queue.queue[j];
              ready_queue.queue[j] = ready_queue.queue[j + 1];
              ready_queue.queue[j + 1] = temp;
          }
      }
  }
}


// =============================================================================
// ISRs
// =============================================================================



//Trata a interrupcao do Timer

// __attribute__((naked, section(".iram1")))
// void systemContext(void) { //Chamada pela interrupcao do Timer
//     saveContext(&Descriptors[TaskRunning]);

//     uint32_t mepc_val;
//     asm volatile("csrr %0, mepc" : "=r"(mepc_val));
//     printf("systemContext: TaskRunning=%d mepc=0x%08x\n", TaskRunning, mepc_val);

//     wakeUP();
//    //serialEvent();
//     switchTaskUnsafe();
//     processPrintQueue();
//     SYSTIMER_INT_CLR = (1U << 0);
//     (void)SYSTIMER_INT_ST;                  // APB flush
    
//     restoreContext(&Descriptors[TaskRunning]);
// }

/*
*
* Idle Process - executa quando ready list vazia
*
*/
void idle() {
    gpio_write(LED_PIN, 0);
    printf("'idle' started with TID: %d\n", 0);
     while (1) {
        wdt_disable();  // ← adicione isso
     } ;
}
/*
*
* Rotinas do kernel - Sys Call
*
*/

//Isso aqui também foi alterdo é necessário revisar
void sys_taskcreate(int *tid, void (*taskFunction)(void), uint8_t period, uint8_t wcet) {
    NumberTaskAdd++;
    *tid = NumberTaskAdd;
    Descriptors[NumberTaskAdd].Tid = *tid;
    Descriptors[NumberTaskAdd].State = READY;
    Descriptors[NumberTaskAdd].Join = 0;
    Descriptors[NumberTaskAdd].Time = 0;
    Descriptors[NumberTaskAdd].Period = period;
    Descriptors[NumberTaskAdd].Wcet = wcet;
    Descriptors[NumberTaskAdd].DynamicPeriod = period;
    Descriptors[NumberTaskAdd].DynamicWcet = wcet;

    printf("Creating task with TID: %d, Function: %p, Period: %d, WCET: %d\n", *tid, taskFunction, period, wcet);

    // Calcula o topo da pilha alinhado em 16 bytes
    uint8_t *stackTop = (uint8_t *)((uintptr_t)(Descriptors[*tid].Stack + SizeTaskStack) & ~0xF);
    
    // Posiciona o contexto exatamente 128 bytes abaixo do topo
    Context *ctx = (Context *)(stackTop - sizeof(Context));
    memset(ctx, 0, sizeof(Context)); // Zera tudo (incluindo registradores de uso geral)
    
    ctx->mepc = (uint32_t)taskFunction; // Onde a tarefa começa a rodar
    ctx->mstatus = 0x1880;              // Interrupções habilitadas, modo de máquina

    // O Stack Pointer da tarefa aponta DIRETAMENTE para a estrutura Context
    Descriptors[*tid].P = (uint8_t *)ctx;
}



void sys_start(int scheduler) {
    int i;
    SchedulerAlgorithm = scheduler;
    switch (SchedulerAlgorithm) {
        case RR:
            for (i = 1; i <= NumberTaskAdd; i++) {
                InsertReadyList(i);
            }
            sortReadyList();
            break;
        default:
            break;
    }
}

void sys_getmynumber(int *number)
{
  *number=Descriptors[TaskRunning].Tid ;
}

void sys_ligaled()
{
  //PORTB = PORTB | 0x20;
}

void sys_desligaled()
{
  //PORTB = PORTB & 0xDF;
}

void sys_setmyname(const char *name)
{
  Descriptors[TaskRunning].name=name;
}

void sys_getmyname(const char *name)
{
  strcpy(name, Descriptors[TaskRunning].name);
}

void sys_semwait(sem_t *semaforo)
{   
    semaforo->count--;
    if(semaforo->count < 0)
    {
      semaforo->sem_queue[semaforo->tail] = TaskRunning;
      Descriptors[TaskRunning].State = BLOCKED ;
      semaforo->tail++;
      if(semaforo->tail == MaxNumberTask-1) semaforo->tail = 0;
      switchTask();
    }
}

void sys_sempost(sem_t *semaforo)
{
     semaforo->count++;
     if(semaforo->count <= 0)
     {
       Descriptors[semaforo->sem_queue[semaforo->header]].State = READY;
       InsertReadyList(semaforo->sem_queue[semaforo->header]);
       semaforo->header++;
       if(semaforo->header == MaxNumberTask-1) semaforo->header = 0;
     }
}

void sys_seminit(sem_t *semaforo, int ValorInicial)
{
  semaforo->count = ValorInicial;
  semaforo->header = 0;
  semaforo->tail = 0;
}

void sys_sleep(unsigned int segundo)
{
  //Descriptors[TaskRunning].Time = segundo/ClkT;
  Descriptors[TaskRunning].Time = (segundo*1000000)/Slice ;
  if(Descriptors[TaskRunning].Time > 0)
  {
    Descriptors[TaskRunning].State = BLOCKED;
    switchTask();
    
    //select() ;
  }
}
void sys_msleep(unsigned int mili)
{
  Descriptors[TaskRunning].Time = (mili/ClkT)/1000;
  if(Descriptors[TaskRunning].Time > 0)
  {
    Descriptors[TaskRunning].State = BLOCKED;
    switchTask();
  }
}

void sys_usleep(unsigned int micro)
{
  Descriptors[TaskRunning].Time = (micro/ClkT)/1000000;
  if(Descriptors[TaskRunning].Time > 0)
  {
    Descriptors[TaskRunning].State = BLOCKED;
    switchTask();
  }
}

void sys_rmssleep(void)
{
  if(Descriptors[TaskRunning].State == RUNNING)
  {
    Descriptors[TaskRunning].State = BLOCKED;
    switchTask();
  }
}

