GabrielPCamargo/nke_esp32c3/src/NKE.c
void p0() { 
    
  printf("'p0' started with TID: %d\n", 0);
  static int number0;
  getmynumber(&number0);  
  while (1) {
    //rintReadyList();
    nkprint("P0 running\n", 0);
    for(volatile long d = 0; d < (817200L); d++);
    nkprint("P0 Finished\n", 0);
    rmssleep();
  }
}

void p1() {
  printf("'p1' started with TID: %d\n", 1);
  static int number1;
  getmynumber(&number1);
  while (1) {
    //printReadyList();
    nkprint("P1 running\n", 0);
    for(volatile long d = 0; d < 1816000L; d++);
    nkprint("P1 Finished\n", 0);
    rmssleep();
  }
}

void p2() {
  printf("'p2' started with TID: %d\n", 2);
  static int number2;
  getmynumber(&number2);
  while (1) {
    //printReadyList();
    nkprint("P2 running\n", 0);
    for(volatile long d = 0; d < 2724000L; d++);
    nkprint("P2 Finished\n", 0);
    rmssleep();
  }
}

/*************************************************************
*                                                            *
*               Setup e criar Tasks                    *
*                                                            *
*                                                            *
*************************************************************/

// =============================================================================
// VECTOR TABLE — modo vetorizado: interrupção N → base + N*4
// =============================================================================
extern void real_vector_table(void);

__attribute__((naked, section(".iram1")))
void isr_vector_table(void) {
    __asm__ volatile (
        ".align 8\n"
        ".global real_vector_table\n"
        "real_vector_table:\n"
        ".option push\n"
        ".option norvc\n"
        "j ecall_vector     \n"     // ID 0 - Nossas Syscalls via ecall!
        "j .                \n"     // ID 1
        "j .                \n"     // ID 2
        "j .                \n"     // ID 3
        "j .                \n"     // ID 4
        "j .                \n"     // ID 5 
        "j timer_vector     \n"     // ID 6 - Nosso Timer blindado!
        ".option pop\n"
    );
}

// Para substituir aquele último restoreContext no main()
__attribute__((naked))
void startOS(uint8_t* initial_sp) {
    __asm__ volatile (
        "mv sp, a0 \n\t"
        RESTORE_CONTEXT
    );
}


// =============================================================================
// SYSTIMER INIT — período mode, procedimento exato do TRM 10.5.3
// =============================================================================

static void systimer_init(void) {
    // Passo 0: habilita clock do registrador e UNIT0
    // CLK_EN=bit31, UNIT0_WORK_EN=bit29
    // TARGET0_WORK_EN=bit23 é setado DEPOIS do COMP0_LOAD (passo 5 do TRM)
    SYSTIMER_CONF = (1U << 31) | (1U << 30);

    // Passo 1: seleciona UNIT0 para COMP0 (TIMER_UNIT_SEL=bit31=0) e
    //          escreve o período (bits 25:0) em TARGET0_CONF
    //          PERIOD_MODE ainda em 0 aqui
    SYSTIMER_TARGET0_CONF = Slice & 0x3FFFFFF;

    // Passo 2: strobe COMP0_LOAD para sincronizar o período ao COMP0
    SYSTIMER_COMP0_LOAD = 1;

    // Passo 3: limpa e depois seta PERIOD_MODE (bit30) para entrar em modo período
    SYSTIMER_TARGET0_CONF = Slice & 0x3FFFFFF;          // PERIOD_MODE=0
    SYSTIMER_TARGET0_CONF = (1U << 30) | (Slice & 0x3FFFFFF); // PERIOD_MODE=1

    // Passo 4: habilita COMP0 via CONF_REG bit23 (TARGET0_WORK_EN)
    SYSTIMER_CONF = (1U << 31) | (1U << 30) | (1U << 24);

    // Passo 5: habilita interrupção do COMP0 (bit0)
    SYSTIMER_INT_CLR = (1U << 0);
    SYSTIMER_INT_ENA = (1U << 0);

    // Roteamento INTMTX  ---OKKKKK
    INTMTX_SYSTIMER_T0_MAP     = CPU_INTR_TIMER;
    INTCTL_ENABLE             |= (1U << CPU_INTR_TIMER);
    INTCTL_PRI(CPU_INTR_TIMER) = 14;
}

// =============================================================================
// MAIN
// =============================================================================

int main(void) {
    wdt_disable();
    gpio_output(LED_PIN);
    gpio_write(LED_PIN, 0);

    //delay_ms(4000);

    wdt_disable();
    gpio_output(LED_PIN);
    gpio_write(LED_PIN, 1);

    INTCTL_CLEAR              = 0xFFFFFFFF;
    INTCTL_TYPE               = 0;
    INTCTL_THRESH             = 0;
    
    // ==================== RISC-V CORE ====================
    __asm__ volatile ("csrw mtvec, %0" :: "r"((uintptr_t)real_vector_table | 1U));
    __asm__ volatile ("csrsi mstatus, 0x8");

            
    nkprint("FakeOS \n", 0) ;

    nkprint("Versao 0.0 \n", 0) ;
    
    //seminit(&s0, 1);
    //seminit(&s1, 0);
    //seminit(&s2, 0);
    //seminit(&s3, 0);
    
    taskcreate(&tid0,idle,100, 50);
    taskcreate(&tid1,p0,10, 2);
    taskcreate(&tid2,p1,20, 5);
    taskcreate(&tid3,p2,30, 8);
    // taskcreate(&tid3,p3,1);

    printf("Before start RR: TaskRunning=%d\n", TaskRunning); // Debug
    start (RR) ; //coloca as tasks na fila
    
    systimer_init();

    os_started = true;
    startOS(Descriptors[0].P); //coloca a task idle para rodar (não vai executar até a interrupção, vai ficar no while (1))

    while (1) {
    }
}